src/DataProcessors/ПомощникСозданияПроектовСопровождения/ПомощникСозданияПроектовСопровождения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникСозданияПроектовСопровождения</name>
</mdclass:DataProcessor>

src/InformationRegisters/НастройкиСозданияСопровождения/НастройкиСозданияСопровождения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСозданияСопровождения</name>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/СогласованиеПроектов/СогласованиеПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласованиеПроектов</name>
  <registerRecords>InformationRegister.УП_ОбщиеСведенияПоПроектам</registerRecords>
  <registerRecords>InformationRegister.УП_ВремяВыполнениеПроектов_План</registerRecords>
  <registerRecords>InformationRegister.ВремяВыполненияПроектов</registerRecords>
  <registerRecords>InformationRegister.ОбщиеДанныеПоПроектам</registerRecords>
  <registerRecords>InformationRegister.СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_ИсполнителиПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СтоимостьПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектовИсполнителей</registerRecords>
  <registerRecords>InformationRegister.СтоимостьПроектов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>РуководительПроекта</name>
      <type>
        <types>CatalogRef.Исполнители</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнитьДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Исполнители</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолноеУдалить</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийХранилищеЗначений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетДляКлиентаПоПлану</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМаркер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Маркер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ПомощникСозданияПроектовСопровождения/Forms/Форма/Module.bsl
#Область ОбработчиковСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МесяцСопровождения = НачалоМесяца(ТекущаяДата());
	ОбновитьСписокКонтрагентов();
	
КонецПроцедуры

#КонецОбласти

#Область КомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОбновитьСписокКонтрагентов();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Загружено.Выбран,
	|	Загружено.Исполнитель,
	|	Загружено.Контрагент,
	|	Загружено.Клиент
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	&Загружено КАК Загружено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.Контрагент КАК Контрагент,
	|	ВТ_ИсходныеДанные.Клиент КАК Клиент,
	|	ВТ_ИсходныеДанные.Исполнитель
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|ГДЕ
	|	ВТ_ИсходныеДанные.Выбран
	|ИТОГИ ПО
	|	Контрагент,
	|	Клиент";
	Запрос.УстановитьПараметр("Загружено", СписокКонтрагентов.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаЗапроса_Контрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗапроса_Контрагент.Следующий() Цикл
			// создаем документ
			НовыйДокумент                = Документы.СогласованиеПроектов.СоздатьДокумент();
			НовыйДокумент.Дата           = МесяцСопровождения;
			НовыйДокумент.Контрагент     = ВыборкаЗапроса_Контрагент.Контрагент;
			НовыйДокумент.КонтактноеЛицо = УП_РаботаСДокументамиСервер.ПолучитьКонтактноеЛицоКонтрагента(ВыборкаЗапроса_Контрагент.Контрагент);
			НовыйДокумент.Ответственный  = ПараметрыСеанса.ТекущийПользователь;
			НовыйДокумент.Комментарий    = "#Создан помощником создания проектов согласования";
			
			ВыборкаЗапроса_Клиент = ВыборкаЗапроса_Контрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗапроса_Клиент.Следующий() Цикл
				НовыйПроект                     = НовыйДокумент.Проекты.Добавить();
				НовыйПроект.Клиент              = ВыборкаЗапроса_Клиент.Клиент;
				НовыйПроект.Проект              = СоздатьПроект(НовыйДокумент.Контрагент, ВыборкаЗапроса_Клиент.Клиент);
				НовыйПроект.ВремяВыполнения     = "00:00";
				НовыйПроект.ВыполнитьДо         = КонецМесяца(МесяцСопровождения);
				НовыйПроект.Валюта              = УП_РаботаСДокументамиСервер.ПолучитьВалютуУчета();
				ВыборкаЗапроса_ДетальныеЗаписи = ВыборкаЗапроса_Клиент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЗапроса_ДетальныеЗаписи.Следующий() Цикл
					НовыйПроект.РуководительПроекта = ВыборкаЗапроса_ДетальныеЗаписи.Исполнитель;
					
					НоваяСтрокаИсполнителя                 = НовыйДокумент.Исполнители.Добавить();
					НоваяСтрокаИсполнителя.Клиент          = ВыборкаЗапроса_Клиент.Клиент;
					НоваяСтрокаИсполнителя.Исполнитель     = ВыборкаЗапроса_ДетальныеЗаписи.Исполнитель;
					НоваяСтрокаИсполнителя.Проект          = НовыйПроект.Проект;
					НоваяСтрокаИсполнителя.ВремяВыполнения = "00:00";
				КонецЦикла;
			КонецЦикла;
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СоздатьДокументыНаСервере();
	Предупреждение("Документы успешно созданы");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчиковСобытийЭлементовФормы

&НаКлиенте
Процедура СписокКонтрагентовПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ОбновитьСписокКонтрагентов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИСТИНА КАК Выбран,
	|	НастройкиСозданияСопровождения.Исполнитель,
	|	НастройкиСозданияСопровождения.Контрагент,
	|	НастройкиСозданияСопровождения.Клиент
	|ИЗ
	|	РегистрСведений.НастройкиСозданияСопровождения КАК НастройкиСозданияСопровождения";
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		СписокКонтрагентов.Загрузить(РезультатЗапроса.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьПроект(Контрагент, Клиент)
	
	НовыеПроект                        = Справочники.Проекты.СоздатьЭлемент();
	НовыеПроект.Контрагент             = Контрагент;
	НовыеПроект.Клиент                 = Клиент;
	НовыеПроект.ОтчетДляКлиентаПоПлану = Ложь;
	НомерМесяца = Месяц(МесяцСопровождения);
	Если НомерМесяца = 1 Тогда
		ПредставлениеМесяца = "Январь";
	ИначеЕсли НомерМесяца = 2 Тогда
		ПредставлениеМесяца = "Февраль";
	ИначеЕсли НомерМесяца = 3 Тогда
		ПредставлениеМесяца = "Март";
	ИначеЕсли НомерМесяца = 4 Тогда
		ПредставлениеМесяца = "Апрель";
	ИначеЕсли НомерМесяца = 5 Тогда
		ПредставлениеМесяца = "Май";
	ИначеЕсли НомерМесяца = 6 Тогда
		ПредставлениеМесяца = "Июнь";
	ИначеЕсли НомерМесяца = 7 Тогда
		ПредставлениеМесяца = "Июль";
	ИначеЕсли НомерМесяца = 8 Тогда
		ПредставлениеМесяца = "Август";
	ИначеЕсли НомерМесяца = 9 Тогда
		ПредставлениеМесяца = "Сентябрь";
	ИначеЕсли НомерМесяца = 10 Тогда
		ПредставлениеМесяца = "Октябрь";
	ИначеЕсли НомерМесяца = 11 Тогда
		ПредставлениеМесяца = "Ноябрь";
	ИначеЕсли НомерМесяца = 12 Тогда
		ПредставлениеМесяца = "Декабрь";
	КонецЕсли;
	НовыеПроект.Наименование = Строка(Формат(НачалоМесяца(МесяцСопровождения), "ДЛФ=D")) + "_" + Строка(Клиент) + "_" + "Сопровождение " + Строка(ПредставлениеМесяца) + " " + СтрЗаменить(Год(МесяцСопровождения), Символы.НПП, "") + " г.";
	Попытка
		НовыеПроект.Записать();
		Возврат НовыеПроект.Ссылка;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

#КонецОбласти
